app/views/home/index.html.erb

SELECT  "general_configs".* FROM "general_configs"  ORDER BY "general_configs"."id" ASC LIMIT 1
SELECT "domains".* FROM "domains" WHERE "domains"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "domains" WHERE "domains"."user_id" = $1  [["user_id", 1]]
---
<br />
<% if current_user.domains.count < GeneralConfig.domain_limit %>

SELECT  "domain_ranks".* FROM "domain_ranks" WHERE "domain_ranks"."domain_id" = $1  ORDER BY "domain_ranks"."id" DESC LIMIT 1  [["domain_id", 1]]
---
  <td><%= domain.url %></td>
  <td><%= domain.domain_ranks.last.present? ? domain.domain_ranks.last.rank : nil %></td>