app/controllers/domains_controller.rb

  def create
    @domain = current_user.domains.new(domain_params)
    @domain.url = sep_domain(params[:domain][:url])
    respond_to do |format|
      if @domain.url.present? && @domain.save
---
INSERT INTO "domains" ("url", "name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["url", "yahoo.com"], ["name", "yahoo"], ["description", ""], ["user_id", 1], ["created_at", "2017-04-12 18:40:26.398684"], ["updated_at", "2017-04-12 18:40:26.398684"]]

  def set_domain
    @domain = Domain.find(params[:id])
---
SELECT  "domains".* FROM "domains" WHERE "domains"."id" = $1 LIMIT 1  [["id", 1]]